app/views/users/user_action.html.erb

                                          <p id="commentimage">
                                            <%if comment.user.binary_data.blank?%>
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 2) LIMIT 1