app/controllers/api_controller.rb

INSERT INTO `prayers` (`user_id`, `prayer`, `created_at`, `updated_at`, `location`, `title`, `description`, `lat`, `lang`) VALUES (1, NULL, '2011-03-12 12:53:04', '2011-03-12 12:53:04', NULL, 'sixth', 'fjfjf', '145 ', '234')
---
  def create_prayer
    @prayer = Prayer.new(params[:prayer])
    @prayer.user_id = current_user.id
      if params[:prayer].blank? or params[:prayer][:title].blank? or params[:prayer][:description].blank?
          flash[:notice] = "Please Enter A Prayer All Fields"
          respond_to do |format|
               format.xml  { render :xml => "<?xml version='1.0' encoding='UTF-8'?><message>please enter proper field</message>", :status => :unprocessable_entity }
               format.html {redirect_to :back}
          end
      else
          respond_to do |format|
            @prayer_created = true
            if @prayer.save

SELECT `prayers`.* FROM `prayers` WHERE (`prayers`.user_id = 1)
---
  def prayers
     total_friend_user = current_user.friends
     total_friend_ids = []
     total_friend_user.each {|frid|  total_friend_ids << frid.id  }
     total_friend_ids << current_user.id
     @uprayer=[]
     @uprayer = Prayer.find(:all,:conditions=>"user_id in (#{total_friend_ids.join(',')})",:order =>"id desc")