app/controllers/api_controller.rb

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def prayers
     @user = User.find(params[:id])