app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])
      if params[:comment][:comment].blank?
         flash[:notice]="Please Enter A Comment"
         redirect_to :back
          return
      else
        if params[:comment][:comment].length > 100
          flash[:notice]="Your Comment Character Should Not Be Greater Than 100 Characters"
          redirect_to :back
        else
                 respond_to do |format|
                     if @comment.save
---
INSERT INTO `comments` (`user_id`, `comment`, `created_at`, `updated_at`, `prayer_id`) VALUES (13, 'first prayer comment', '2011-02-24 09:31:40', '2011-02-24 09:31:40', 1)