app/controllers/friendships_controller.rb

  def invite_friend
     @user = User.find_by_login(params[:username])
---
SELECT `users`.* FROM `users` WHERE (`users`.`login` = 'kedar') LIMIT 1

  def pending_invitation
    @user = User.find(current_user.id)
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 3) LIMIT 1

  def invitation_by
    @user = User.find(3)
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 3) LIMIT 1

  def accept_invitation
    @user = User.find(current_user.id)
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 3) LIMIT 1

  def get_all_friend
      @user = User.find(current_user.id)
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 3) LIMIT 1

  def show
    @friendship = Friendship.find(params[:id])
---
SELECT `friendships`.* FROM `friendships` WHERE (`friendships`.`id` = 0) LIMIT 1