app/controllers/friend_requests_controller.rb

SELECT `users`.* FROM `users` WHERE (`users`.`email` = 'suresh@gmaill.com') LIMIT 1
---
  def friend_request
      friend = User.find_by_email(params[:useremail])