app/controllers/prayers_controller.rb

SELECT `prayers`.* FROM `prayers`
---
  def index
    @prayers = Prayer.all

INSERT INTO `prayers` (`user_id`, `prayer`, `created_at`, `updated_at`, `location`, `title`, `description`, `lat`, `lang`) VALUES (1, NULL, '2011-03-12 12:37:36', '2011-03-12 12:37:36', NULL, 'bnm', 'bnm', '345', '345')
---
  def create
    @prayer = Prayer.new(params[:prayer])
      if params[:prayer][:title].blank? or params[:prayer][:description].blank?
          flash[:notice] = "Please Enter A Prayer All Fields"
          redirect_to :back
      else
          respond_to do |format|
            if @prayer.save