app/controllers/sessions_controller.rb

  def create
    notice = "Logged In Successfully"
    logout_keeping_session!
    user = User.authenticate(params[:login], params[:password])
    if user
      # Protects against session fixation attacks, causes request forgery
      # protection if user resubmits an earlier form using back
      # button. Uncomment if you understand the tradeoffs.
      # reset_session
      self.current_user = user
      new_cookie_flag = (params[:remember_me] == "1")
      handle_remember_cookie! new_cookie_flag
      if session[:friendid].blank?
      else
        tempuser = User.find(session[:friendid])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1