app/controllers/users_controller.rb

UPDATE `users` SET `login` = 'tushar', `email` = 'kedar@gmaill.com', `avatar_file_name` = 'administration.png', `avatar_content_type` = 'image/png', `avatar_file_size` = 2119, `avatar_updated_at` = '2011-02-25 13:35:25', `crypted_password` = '63e843e5efd1c1e95543fb54b94f4b9fd299e699', `updated_at` = '2011-02-25 13:35:26' WHERE (`users`.`id` = 3)
---
  def update_profile
    current_user.update_attributes(params[:user])

INSERT INTO `users` (`login`, `name`, `email`, `crypted_password`, `salt`, `created_at`, `updated_at`, `remember_token`, `remember_token_expires_at`, `avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`, `reset_code`) VALUES ('kedar', '', 'kedar.pathak@pragtech.co.in', '51d71239f56b504492d8b141beef28750218a2b1', 'd85e21d5073228fce10afe8a053d5213ee54cd4d', '2011-02-25 14:57:33', '2011-02-25 14:57:33', NULL, NULL, NULL, NULL, NULL, NULL, NULL)
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def create
    logout_keeping_session!
    @user = User.new(params[:userr])
    success = @user && @user.save

    if success && @user.errors.empty?
       notice = "Logged in Successfully"
      # Protects against session fixation attacks, causes request forgery
      # protection if visitor resubmits an earlier form using back
      # button. Uncomment if you understand the tradeoffs.
      # reset session
      #here i need to send email to the registered user

      Notifier.send_welcome_registration(@user).deliver

      if !session[:friendid].blank?
       tempuser = User.find(session[:friendid])

SELECT `prayers`.* FROM `prayers` WHERE (user_id in (3,2,1)) ORDER BY id desc
SELECT `comments`.* FROM `comments` WHERE (`comments`.prayer_id = 1)
---
  def user_action
#       @facebook_cookies["access_token"]
#        @graph = Koala::Facebook::GraphAPI.new(@facebook_cookies["access_token"])
#	      @friends = @graph.get_connections("me", "friends")
#        p @friends[0]
      total_friend_user = current_user.friends
      total_friend_ids = []
      total_friend_user.each {|frid|  total_friend_ids << frid.id  }
      total_friend_ids << current_user.id
      @uprayer=[]
      @uprayer = Prayer.find(:all,:conditions=>"user_id in (#{total_friend_ids.join(',')})",:order =>"id desc")
      @usercomments = []
      @uprayer.each {|epry|  @usercomments << epry.comments }

SELECT `users`.`id` FROM `users` WHERE (`users`.`email` = BINARY 'kedar@gmaill.com') AND (`users`.id <> 3) LIMIT 1
---
  def forgot
    if request.post?
      user = User.find_by_email(params[:user][:email])

SELECT `users`.* FROM `users` WHERE (`users`.`reset_code` = 'ab11affc659a369cd09062afbe4303512891a870') LIMIT 1
UPDATE `users` SET `crypted_password` = 'd04441e41eb494c16b8b8676edac5ee2dff65c70', `updated_at` = '2011-02-25 14:35:30' WHERE (`users`.`id` = 3)
---
   def reset
    flash[:notice]=nil if flash[:notice]
    @user = User.find_by_reset_code(params[:reset_code]) unless params[:reset_code].nil?

    if @user.blank?
        flash[:notice] = "Your Reset Code Has Been Expire Please Send Request Again"

        redirect_to "/users/forgot"
    else

        if request.post?
          if params[:user][:password].blank? and params[:user][:password_confirmation].blank?
                 p "stille iiiiiiiiiiii"
                  flash[:notice]="Please Enter Password"
                  render :action=>"reset"
          else
              p "still im in else"
                if @user.update_attributes(:password => params[:user][:password], :password_confirmation => params[:user][:password_confirmation])

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def show_profile
    @user = User.find(params[:id]);